Ran Plan for project: `my-infrastructure` dir: `diplom/main` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # local_file.hosts_templatefile will be created
+ resource "local_file" "hosts_templatefile" {
      + content              = <<-EOT
            [kube_control_plane]
            master1 ansible_host=192.168.1.11    ip=192.168.1.11  etcd_member_name=etcd1
            master2 ansible_host=192.168.2.22    ip=192.168.2.22  etcd_member_name=etcd2
            master3 ansible_host=192.168.3.33    ip=192.168.3.33  etcd_member_name=etcd3
            
            [etcd:children]
            kube_control_plane
            
            [calico_rr]
            
            [k8s_cluster:children]
            kube_control_plane
            calico_rr
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0644"
      + filename             = "/atlantis-data/repos/dreadsolnce/netology_courses/22/default/diplom/main/hosts.ini"
      + id                   = (known after apply)
    }

  # yandex_compute_instance.bastion will be updated in-place
~ resource "yandex_compute_instance" "bastion" {
        id                        = "fhmgohok96g6ih0s5s4i"
      ~ metadata                  = {
          ~ "ssh-keys"           = <<-EOT
              - ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC+nKYEMsVkj5inclbxz5XQ0qPzZ+uWROHPnbQ1JpRoWRChFFQDJG3WtAqrUjQ2/4c7xAoKTwFcBaxJQWNPeqXK+zSQs7tDh57+XnvBJGkYa7lRYMgZXVq0VsHJIDHAqRHqZwnks9KQExObRffB+9xGgGRsV/AAaB9FmhLQ+bST1E87DHVZJOFstxQ6nfRgl/G47WKw8DAE0ODQwUDq07GOKteh8iLwrZkLL1DkbnfPeKeYcZxY4zmP3RJmU4EyK1iHfBuF50eHeGQ3+SC58U/TZM2L7HIGZRoKczB8+rdh3slfpS0zEmPhiqCCzb421RvRAQBiycrO/6OjjQgvgh6lMvFPHz/2xAeuX0DwBrqWfABbwkeZkPOuvfOhtz0Fh4T+O15Glxk/BN6M+zSZDwj/QJc19UAGsZfp910ZgBQI8N/PfwXOCwAimVSBOtyXTrW5AieSuxVTi0nVt/HwBnCoBV4Fmbv3DiZdCBQ56XYAyPj2MihN6agZe32Ss/ABe3M= kvl@VPS47612.ipserver.su
              + ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCad7tWiE8y4PrK2pG4jmXGriccjUFyiC2jOo0xVAosqPiQfFYqoXlPdUpgoH+InQP2MiOnIK7iZTm/i5ZRlxkSibCm9GjyHXBBXvGk9rBPYtgMeF7YP3fqQlQ+DsVtoj6K/75Mw5n4ZkVYMapLO9SSTicTy8WI8UFd+X0EWa5FT0gJr4sHKDjqMv62E5iyUoX+JZIZAvi4rMiK518Mc11fkmI/AJQr5/kePkXaSgdRtHEqB7GoKyI7062ONNCENw5ww/C2LAnfac2z9wllgnLeqhTb7BJ+JOnATMmqMFUO/tnE6o5L/U5JwZlpJW2UJN2l8cNx2C33Hthrkrk12JdFauQgCamKHBQNOPkWr3fIjyO4u4VVN34mmvcaYPEg4gubmGL25r7OqJys0DfXK18vrr3sW5ws37iFvoGrLbGla12YtKATXkGjvXCoAHz05HsWJz8PC6YK25ydRYTFbs0METnhgp0YB9ElTYHDlhLBUmEgeU0cqE6C8kDt7+r5zG8= kvl@main
            EOT
          ~ "user-data"          = <<-EOT
                #cloud-config
                users:
                  - name: ubuntu
                    groups: sudo
                    shell: /bin/bash
                    sudo: ["ALL=(ALL) NOPASSWD:ALL"]
                    ssh_authorized_keys:
              -       - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC+nKYEMsVkj5inclbxz5XQ0qPzZ+uWROHPnbQ1JpRoWRChFFQDJG3WtAqrUjQ2/4c7xAoKTwFcBaxJQWNPeqXK+zSQs7tDh57+XnvBJGkYa7lRYMgZXVq0VsHJIDHAqRHqZwnks9KQExObRffB+9xGgGRsV/AAaB9FmhLQ+bST1E87DHVZJOFstxQ6nfRgl/G47WKw8DAE0ODQwUDq07GOKteh8iLwrZkLL1DkbnfPeKeYcZxY4zmP3RJmU4EyK1iHfBuF50eHeGQ3+SC58U/TZM2L7HIGZRoKczB8+rdh3slfpS0zEmPhiqCCzb421RvRAQBiycrO/6OjjQgvgh6lMvFPHz/2xAeuX0DwBrqWfABbwkeZkPOuvfOhtz0Fh4T+O15Glxk/BN6M+zSZDwj/QJc19UAGsZfp910ZgBQI8N/PfwXOCwAimVSBOtyXTrW5AieSuxVTi0nVt/HwBnCoBV4Fmbv3DiZdCBQ56XYAyPj2MihN6agZe32Ss/ABe3M= kvl@VPS47612.ipserver.su
              +       - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCad7tWiE8y4PrK2pG4jmXGriccjUFyiC2jOo0xVAosqPiQfFYqoXlPdUpgoH+InQP2MiOnIK7iZTm/i5ZRlxkSibCm9GjyHXBBXvGk9rBPYtgMeF7YP3fqQlQ+DsVtoj6K/75Mw5n4ZkVYMapLO9SSTicTy8WI8UFd+X0EWa5FT0gJr4sHKDjqMv62E5iyUoX+JZIZAvi4rMiK518Mc11fkmI/AJQr5/kePkXaSgdRtHEqB7GoKyI7062ONNCENw5ww/C2LAnfac2z9wllgnLeqhTb7BJ+JOnATMmqMFUO/tnE6o5L/U5JwZlpJW2UJN2l8cNx2C33Hthrkrk12JdFauQgCamKHBQNOPkWr3fIjyO4u4VVN34mmvcaYPEg4gubmGL25r7OqJys0DfXK18vrr3sW5ws37iFvoGrLbGla12YtKATXkGjvXCoAHz05HsWJz8PC6YK25ydRYTFbs0METnhgp0YB9ElTYHDlhLBUmEgeU0cqE6C8kDt7+r5zG8= kvl@main
                
                package_update: true
                package_upgrade: false
                
                packages: ["htop","tmux","net-tools","mc","vim","nginx","ansible","git","python3-venv","libssl-dev","liblzma-dev","python3-tk","libsqlite3-dev","libreadline-dev","libffi-dev","libncurses5-dev","libncursesw5-dev","libbz2-dev","build-essential","gcc","python3-pip","mysql-client"]
                
                write_files:
                  # Копирование конфигурационного файла nginx (обратный прокси). Используем кодировку для передачи файла, т.к. даные содержат спец символы в виде :, а он корректно не передается
                  - path: /tmp/proxy
                    permissions: '0644'
                    encoding: b64
              -     content: dXBzdHJlYW0gYmFja2VuZF9zZXJ2ZXJzIHsKICAgIHNlcnZlciAxOTIuMTY4LjEuMTE6MzEwMDAgbWF4X2ZhaWxzPTEgZmFpbF90aW1lb3V0PTEwczsKICAgIHNlcnZlciAxOTIuMTY4LjIuMjI6MzEwMDAgbWF4X2ZhaWxzPTEgZmFpbF90aW1lb3V0PTEwczsKICAgIHNlcnZlciAxOTIuMTY4LjMuMzM6MzEwMDAgbWF4X2ZhaWxzPTEgZmFpbF90aW1lb3V0PTEwczsKIyBzZXJ2ZXIgMTI3LjAuMC4xOjgwODA7CiMgc2VydmVyIGJhY2t1cDEuZXhhbXBsZS5jb20gYmFja3VwOyAjINCg0LXQt9C10YDQstC90YvQuSDRgdC10YDQstC10YAKfQoKdXBzdHJlYW0gYmFja2VuZF9hcHAgewogICAgc2VydmVyIDE5Mi4xNjguMS4xMTozMTEwMCBtYXhfZmFpbHM9MSBmYWlsX3RpbWVvdXQ9MTBzOwogICAgc2VydmVyIDE5Mi4xNjguMi4yMjozMTEwMCBtYXhfZmFpbHM9MSBmYWlsX3RpbWVvdXQ9MTBzOwogICAgc2VydmVyIDE5Mi4xNjguMy4zMzozMTEwMCBtYXhfZmFpbHM9MSBmYWlsX3RpbWVvdXQ9MTBzOwp9Cgp1cHN0cmVhbSBiYWNrZW5kX2F0bGFudGlzIHsKICAgIHNlcnZlciAxOTIuMTY4LjEuMTE6MzAxNDEgbWF4X2ZhaWxzPTEgZmFpbF90aW1lb3V0PTEwczsKICAgIHNlcnZlciAxOTIuMTY4LjIuMjI6MzAxNDEgbWF4X2ZhaWxzPTEgZmFpbF90aW1lb3V0PTEwczsKICAgIHNlcnZlciAxOTIuMTY4LjMuMzM6MzAxNDEgbWF4X2ZhaWxzPTEgZmFpbF90aW1lb3V0PTEwczsKfQoKc2VydmVyIHsKICAgIGxpc3RlbiA4MDsKICAgIHNlcnZlcl9uYW1lIGdyYWZhbmEua3ZscHJvLnNpdGU7CgogICAgbG9jYXRpb24gLyB7CiAgICAgICAgcHJveHlfcGFzcyBodHRwOi8vYmFja2VuZF9zZXJ2ZXJzOwogICAgICAgIHByb3h5X3NldF9oZWFkZXIgSG9zdCAkaG9zdDsKICAgICAgICBwcm94eV9zZXRfaGVhZGVyIFgtUmVhbC1JUCAkcmVtb3RlX2FkZHI7CiAgICAgICAgcHJveHlfc2V0X2hlYWRlciBYLUZvcndhcmRlZC1Gb3IgJHByb3h5X2FkZF94X2ZvcndhcmRlZF9mb3I7CiAgICAgICAgcHJveHlfc2V0X2hlYWRlciBYLUZvcndhcmRlZC1Qcm90byAkc2NoZW1lOwogICAgfQp9CnNlcnZlciB7CiAgICBsaXN0ZW4gODA7CiAgICBzZXJ2ZXJfbmFtZSBhbmltYWxzLmt2bHByby5zaXRlOwoKICAgIGxvY2F0aW9uIC8gewogICAgICAgIHByb3h5X3Bhc3MgaHR0cDovL2JhY2tlbmRfYXBwOwogICAgICAgIHByb3h5X3NldF9oZWFkZXIgSG9zdCAkaG9zdDsKICAgICAgICBwcm94eV9zZXRfaGVhZGVyIFgtUmVhbC1JUCAkcmVtb3RlX2FkZHI7CiAgICAgICAgcHJveHlfc2V0X2hlYWRlciBYLUZvcndhcmRlZC1Gb3IgJHByb3h5X2FkZF94X2ZvcndhcmRlZF9mb3I7CiAgICAgICAgcHJveHlfc2V0X2hlYWRlciBYLUZvcndhcmRlZC1Qcm90byAkc2NoZW1lOwogICAgfQoKfQoKc2VydmVyIHsKICAgIGxpc3RlbiA4MDsKICAgIHNlcnZlcl9uYW1lIGF0bGFudGlzLmt2bHByby5zaXRlOwoKICAgIGxvY2F0aW9uIC8gewogICAgICAgIHByb3h5X3Bhc3MgaHR0cDovL2JhY2tlbmRfYXRsYW50aXM7CiAgICAgICAgcHJveHlfc2V0X2hlYWRlciBIb3N0ICRob3N0OwogICAgICAgIHByb3h5X3NldF9oZWFkZXIgWC1SZWFsLUlQICRyZW1vdGVfYWRkcjsKICAgICAgICBwcm94eV9zZXRfaGVhZGVyIFgtRm9yd2FyZGVkLUZvciAkcHJveHlfYWRkX3hfZm9yd2FyZGVkX2ZvcjsKICAgICAgICBwcm94eV9zZXRfaGVhZGVyIFgtRm9yd2FyZGVkLVByb3RvICRzY2hlbWU7CiAgICB9Cgp9Cg==
              +     content: dXBzdHJlYW0gYmFja2VuZF9zZXJ2ZXJzIHsKICAgIHNlcnZlciAxOTIuMTY4LjEuMTE6MzEwMDAgbWF4X2ZhaWxzPTEgZmFpbF90aW1lb3V0PTEwczsKICAgIHNlcnZlciAxOTIuMTY4LjIuMjI6MzEwMDAgbWF4X2ZhaWxzPTEgZmFpbF90aW1lb3V0PTEwczsKICAgIHNlcnZlciAxOTIuMTY4LjMuMzM6MzEwMDAgbWF4X2ZhaWxzPTEgZmFpbF90aW1lb3V0PTEwczsKIyBzZXJ2ZXIgMTI3LjAuMC4xOjgwODA7CiMgc2VydmVyIGJhY2t1cDEuZXhhbXBsZS5jb20gYmFja3VwOyAjINCg0LXQt9C10YDQstC90YvQuSDRgdC10YDQstC10YAKfQoKdXBzdHJlYW0gYmFja2VuZF9hcHAgewogICAgc2VydmVyIDE5Mi4xNjguMS4xMTozMTEwMCBtYXhfZmFpbHM9MSBmYWlsX3RpbWVvdXQ9MTBzOwogICAgc2VydmVyIDE5Mi4xNjguMi4yMjozMTEwMCBtYXhfZmFpbHM9MSBmYWlsX3RpbWVvdXQ9MTBzOwogICAgc2VydmVyIDE5Mi4xNjguMy4zMzozMTEwMCBtYXhfZmFpbHM9MSBmYWlsX3RpbWVvdXQ9MTBzOwp9Cgp1cHN0cmVhbSBiYWNrZW5kX2F0bGFudGlzIHsKICAgIHNlcnZlciAxOTIuMTY4LjEuMTE6MzAxNDEgbWF4X2ZhaWxzPTEgZmFpbF90aW1lb3V0PTEwczsKICAgIHNlcnZlciAxOTIuMTY4LjIuMjI6MzAxNDEgbWF4X2ZhaWxzPTEgZmFpbF90aW1lb3V0PTEwczsKICAgIHNlcnZlciAxOTIuMTY4LjMuMzM6MzAxNDEgbWF4X2ZhaWxzPTEgZmFpbF90aW1lb3V0PTEwczsKfQoKc2VydmVyIHsKICAgIGxpc3RlbiA4MDsKICAgIHNlcnZlcl9uYW1lIGdyYWZhbmEua3ZscHJvLnNpdGU7CgogICAgbG9jYXRpb24gLyB7CiAgICAgICAgcHJveHlfcGFzcyBodHRwOi8vYmFja2VuZF9zZXJ2ZXJzOwogICAgICAgIHByb3h5X3NldF9oZWFkZXIgSG9zdCAkaG9zdDsKICAgICAgICBwcm94eV9zZXRfaGVhZGVyIFgtUmVhbC1JUCAkcmVtb3RlX2FkZHI7CiAgICAgICAgcHJveHlfc2V0X2hlYWRlciBYLUZvcndhcmRlZC1Gb3IgJHByb3h5X2FkZF94X2ZvcndhcmRlZF9mb3I7CiAgICAgICAgcHJveHlfc2V0X2hlYWRlciBYLUZvcndhcmRlZC1Qcm90byAkc2NoZW1lOwogICAgfQp9CnNlcnZlciB7CiAgICBsaXN0ZW4gODA7CiAgICBzZXJ2ZXJfbmFtZSBhbmltYWxzLmt2bHByby5zaXRlOwoKICAgIGxvY2F0aW9uIC8gewogICAgICAgIHByb3h5X3Bhc3MgaHR0cDovL2JhY2tlbmRfYXBwOwogICAgICAgIHByb3h5X3NldF9oZWFkZXIgSG9zdCAkaG9zdDsKICAgICAgICBwcm94eV9zZXRfaGVhZGVyIFgtUmVhbC1JUCAkcmVtb3RlX2FkZHI7CiAgICAgICAgcHJveHlfc2V0X2hlYWRlciBYLUZvcndhcmRlZC1Gb3IgJHByb3h5X2FkZF94X2ZvcndhcmRlZF9mb3I7CiAgICAgICAgcHJveHlfc2V0X2hlYWRlciBYLUZvcndhcmRlZC1Qcm90byAkc2NoZW1lOwogICAgfQoKfQoKc2VydmVyIHsKICAgIGxpc3RlbiA4MDsKICAgIHNlcnZlcl9uYW1lIGF0bGFudGlzLmt2bHByby5zaXRlOwoKICAgIGxvY2F0aW9uIC8gewogICAgICAgIHByb3h5X3Bhc3MgaHR0cDovL2JhY2tlbmRfYXRsYW50aXM7CiAgICAgICAgcHJveHlfc2V0X2hlYWRlciBIb3N0ICRob3N0OwogICAgICAgIHByb3h5X3NldF9oZWFkZXIgWC1SZWFsLUlQICRyZW1vdGVfYWRkcjsKICAgICAgICBwcm94eV9zZXRfaGVhZGVyIFgtRm9yd2FyZGVkLUZvciAkcHJveHlfYWRkX3hfZm9yd2FyZGVkX2ZvcjsKICAgICAgICBwcm94eV9zZXRfaGVhZGVyIFgtRm9yd2FyZGVkLVByb3RvICRzY2hlbWU7CiAgICAgICAgcHJveHlfc2V0X2hlYWRlciBVcGdyYWRlICRodHRwX3VwZ3JhZGU7CiAgICAgICAgcHJveHlfc2V0X2hlYWRlciBDb25uZWN0aW9uICJ1cGdyYWRlIjsKCiAgICB9Cgp9Cg==
                
                  # Файл с хостами для запуска плейбука установки кластера k8s
                  - path: /tmp/hosts.ini
                    permissions: '0644'
                    encoding: b64
                    content: W2t1YmVfY29udHJvbF9wbGFuZV0KbWFzdGVyMSBhbnNpYmxlX2hvc3Q9MTkyLjE2OC4xLjExICAgIGlwPTE5Mi4xNjguMS4xMSAgZXRjZF9tZW1iZXJfbmFtZT1ldGNkMQptYXN0ZXIyIGFuc2libGVfaG9zdD0xOTIuMTY4LjIuMjIgICAgaXA9MTkyLjE2OC4yLjIyICBldGNkX21lbWJlcl9uYW1lPWV0Y2QyCm1hc3RlcjMgYW5zaWJsZV9ob3N0PTE5Mi4xNjguMy4zMyAgICBpcD0xOTIuMTY4LjMuMzMgIGV0Y2RfbWVtYmVyX25hbWU9ZXRjZDMKCltldGNkOmNoaWxkcmVuXQprdWJlX2NvbnRyb2xfcGxhbmUKCltjYWxpY29fcnJdCgpbazhzX2NsdXN0ZXI6Y2hpbGRyZW5dCmt1YmVfY29udHJvbF9wbGFuZQpjYWxpY29fcnIK
                
                  # Приватный клюя для VM БАСТИОН
                  - path: /tmp/id_rsa
                    permissions: '0600'
                    encoding: b64
                    content: LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlKS0FJQkFBS0NBZ0VBa3ltemlVSGNybDV3RDBqQ3hQK3NkdEFxYTRCTnV6VnU1Z1UrZzU5cytISGljUlJnCkw5eDY1QWMxRTMycmFtZWZtVjdXRXhmSWVJZlVEVFllRmd3Rk9BY21IdkRxc1U5NHVMK0RIc2MzbnVleDkvYisKZUtKdTBNZEZBaWs4V1d1ajRRcHJYK1V1Y2k5K29Sd3FCS0hQMzJVUTRsWEs4TXU5bUFndXBFaUVVVnR1QTlYbgpTbDNvWkZyWVRLb0plOFNsZU0rL1JrVUFwUzA3aDR1NkFjc2hTV0lKZjlSd3pSNW5TZS84bTg5Q1ZBbUhYK3J5ClRpbTl4ZTZlRXNXV2tndDdqcVNuaUsxU21vUW5pd1Zrei9MV2IxWWpPUEN0WHB2dFBwNzhUZGc1amwwQ2hHd3IKN2VMZGE5RTdpZ1dFWmJrNHd0ZTdabHA5YXdveWQ4N3VZTWFDdUFXL3BINEVRNW85L2xrM0hydjAwcWJ5Z01WcApoNUE4VFhFY01adVVuTndjNit3Z2tOcXZsZmFXU1YwUUVUbTBvT2FWR0Z2SDdhaFc1cGtaWHZBZlNyR2F2WncrCnA5VnlFYndoR2JjOFBSVk55MTEzV3pKTUYzYzJ0MGpQL1RDaGthVlppc0RlZjZEVjdDWktvSjBVNlJHMmVDM20KQkhpS0RHL3lzTXRvUHNwWGpGOUdGOUFMWDN4bFVlYzdaUm9Xa3M0NmY2UHdCUVBjMmd6djY2MnFLZ2xsU3FPUgpnczJ2dnpkVGdPMXgvdkhMWDN0SWI4aGgxOXNYSi9QMDByK1hRb1JleVEybXFITldQbldXNXo4bHV4TE1VRGZ2CkZaeURQS2RpQ2wxTHBuUkswR05CdWxZUmFyd0NRZlo3T0kzK0Q1ejBtR090TWNwYmdrSVJmV3BtbU5zQ0F3RUEKQVFLQ0FnQUUvZE5vMHJrcm1JS2dVN0NSN3dLSWJsaURtRmN4QkJSMGt3OHBkcjdDOTd4UW1wUUYxU3FLVWF5cAo1WHJSZFFRZ1VMaDNpRklVdFUrRVJzenYxK2E3YWtVUGNRSGpScndYYW9PRjdnZTIxZjJlMk03ejBTUTRmZ3RuCjNxakozYXJsT2tkWXJUdEFrYVRXTkZCelZsN291c1h5VmNScnRROERoZ0s1WTVTd2o4QTkxTjBKTGM1eEFDa0cKTmtSQkZJeTllZjJpWW00dHJCV1hVbnNOV3g3Mm5TTERKaHczWGF2dkFaU01LL3FaM09sSEV4aURmWmVPdnpvZAo5SzYrRFRIYXh3dU00cjZDbnBYbmt5VEN1dVl0cnNkZUVJNHZQMnpsVVZyOGM4RXNCRXcwM0Q3UXpSazJpK0wyCloyZ2FVNVZLbGNSMXcyVmhDUGcxZEUrcnhneTc5UUNxcUtSMkZqaDBIamFpZDVJWWhJaWczUjN6QTVCQVpLOW8KYStGQUQ1NmVWQldvd0Z0SFc5d1dJbUNGRW5SaGZpTG1zRGd4K2dJNXM2R2RISkxHa3FqNi9FQ1NXTHMrdmZrYgpldlhrM0NmTFpjc050d3BWZjhlQjRmU2Y0SW9GT0J0Zkl2TUNIWWl0ZFZRVGdGcE85TzdFUkZRdW1Oc2NWcS9mCkJMYVE4dVpubnJJbE9idjJ0U1VDbVpjUXFQcUpxVEV5RDNJRlBkdmozSUdtUTdxVWZRSEZrTXNGYXJCdm5JWnUKTmsvWEN0bE1FV3RSVFE5YUcvZmhJZUdxbXJWRmZ5Wng0RHlxSWxMeFY3Z2hocGpqYW43aTd2RDdCQVFwSmNTcwoyZ052Q3lHdDBuaUo1QnRVMzFyUmVPQlh4Q0lZWWVzNHdnUmR5ME90eXppemVZUFZjUUtDQVFFQXdIS1ordVU3CldMNmp5MGo1bG5YWVFIMmhzK041QWJkUnc2OWIzRjZHTHdDcW55NnpuYjExY0F6Wkp6SVdUSXVaSmlWZko2WXYKZWVsU2ZRTWNXTDJDTkZOdDNOZHFOKy96MUF6QWFDc0puclVQNDlla3JaeWJxLzltUGFyTFlTcWJ2V0lUdUJ4bQpCU3dwWVZsU0pKclhZYU5rWDFhTm9JcTBFYkxGSTMvMEx2QTVnS1Zsbkt5Nzdxcm5RYjFyaVN6UG9tMzdNWWpkClhlK1lqQSt4Qkx0OFVTdFFHTXFOVE9STXpMb3JmdWpyNCtLR1NPcCtZaCtQOFVNZVAvZ1ZSN081K2cya05vVWsKRkp3QXBDMEFQaTNRRzB2SjZKcVRmbjh4MDZEc3lndkhWcmJnVUZvZTRyZHdVb1NIcXU0d0NOQjNCNHhTS3RXUAphS3V5R2dLd3diSENTd0tDQVFFQXc4TEJhbjhsUHJTeGs2ak9lL3BEY2libnNHZFR5dGpJTkw1azJpbkMzOHY2CnlPWHQwZXRzTlJ3dW5lQzNKNktKQ0tneWpPMENaSi9ZeVpxbUVuNmpYaHZheFZ5ODMwSEJGT0pyTXBuMCt3cWMKM1oyYXdMUXFqaE1GWDNyTjY2czZLVVFsOUtzVktHZ3M0YXdadTdodytIRUJnZmhhZVdsZ3pHcFA1YThBVkdBUQo1ek14NHVUS0pQamdlNjRFRUdhaGtBSkZNWkU4MUUvQkNaTktjNVUwZkxEYTR5Zis3Q0pDRmhBb0V6RXloN24yCmZpaWJsN3BHVlZNUWoxU1c2ZjgzN0NJYmlZRlFoaXlVdk1HU2V5VXRGYldpcGhVTHZWbGZRMEVlZHBraEdQVUoKNDFpY2hES1BRNllsd1k4Q1hKWkJqVW1ubHVmOGgzUFVHMGxmYkZ2cHNRS0NBUUJQNFlIZXJiWGprVVlseEVXdApXWDhJemQwSDhUeXlKS2l3eENJcUo2WWs3bTdrSWh0Mk4wVCszS1pxYVpUdDh1Zi8rSFUxM1BwSjdUcExIN1p0CmMwUVBlaTNaQkNWWDBLYng5dFVLcUFxWE1PckdsU1VLMXoyYXVDbDFJV2JJRDBxVDRwanl5LzdnMk1MWVlKNEQKQ2E2ckhZbzFOSlVXOVZ2bkdNQlJpdlFOWTdOS25keSttc2hyT2M5QjcyRXFrRW9qVHVsOFZ5WWpycWN3US9jagpVcnM0YWZVV1JVVS9qR2dBZHFwRlJHTmR0Ukl1US85dnRWQW5RY2ZWbjZFZG9SRnFKSzFyMy9ucEFCUVlFWUhQClRXN2JWYXNhZk1jS003dTM3MDA2VklkS2pDQXgyaWFGenNTMXk4TVFoVXUwN09yclhDaGpGVUF3bjB3UEZkek8KbVgxZkFvSUJBUUM0QWI2UWZnYmlWREorbXpQTHNVZm9hczFwTVJiQUd0akZTeG05UDNmZnFQcUlFQ2hsSXlkSgpITDVzeENjazZGQnFoTDlQWEJEZHlLcWJoZlFJZW1UUk50bUNubE1pZjhvZitWdk42bzB0MDZIelpndHFpMjljCnNHQmlpU282Rlc3TUR6U21NSkhvczFOTXBOcGphMUUxRmZQVzJUMGgxbjJZWjIzR2RhS1hyTnoybFZhVThYMVoKRjE3YW9vMUxaVTBEOGo1Y0F5cnNYak1TN3hJU1p2TTVLWHYxL1VoUGFUdzVST0tHZDc0SmVqRktFSjJBRnlXNQpXaVM4dFVSTm13cFR1Uk90UXBJUUxLTjZjWEZnczJjWGV1M3hzdUtnRHZ2T1djMXFxVEZGSmo4dkpjR3BPV1VVCnIzM1ozTFRabHByelZZSmtCSmVJTXNYekNCcmIzZUZoQW9JQkFDMnBXYnQ0MHJZZHdOM0cwUUh5S3llR1h5WVgKeDFVZjk4SXlGeHVXSVk5VHVyKzZDOVdia0lkZjZOMFBrdVNCQ2xrblJ1bjVhS20zQ0o0dWZlVWhILzdsSlJxZworNmdsV2FTak1uMzRXK3Z6ZkZTdXU5c2JKMmM4YWkyVmVMUVZDOEEzL0lmTUlEQlJTMzZjS0lFSkMrVVdJMWNGCmhZRDJZNUdBUjRLMzYwV0RSMlptR2tmemR3MFF2RmE3aTJwemFBWmFwdGtGMUpDRkd3amlQVFl6NzRxUW02bmkKNkZnMzRpblU3T25FZzJzbFcwSG9QU0RibFk1bXI2VmN2NTF4OGx1YW05WTkrWUpVQWJ3ckNIMDlqVW51OThPUwo1Qis0YmRyZ0ZsSlMrSHdpYnFrNXZDa2JyejI1VE4wckZyMlFzVG9aYU92a2dRbUtWWDRkd3FqU3JGMD0KLS0tLS1FTkQgUlNBIFBSSVZBVEUgS0VZLS0tLS0K
                
                  # Файл с настройками кластера
                  - path: /tmp/addons.yml
                    permissions: '0644'
                    encoding: b64
                    content: LS0tCiMgS3ViZXJuZXRlcyBkYXNoYm9hcmQKIyBSQkFDIHJlcXVpcmVkLiBzZWUgZG9jcy9nZXR0aW5nLXN0YXJ0ZWQubWQgZm9yIGFjY2VzcyBkZXRhaWxzLgojIGRhc2hib2FyZF9lbmFibGVkOiBmYWxzZQoKIyBIZWxtIGRlcGxveW1lbnQKaGVsbV9lbmFibGVkOiB0cnVlCgojIFJlZ2lzdHJ5IGRlcGxveW1lbnQKcmVnaXN0cnlfZW5hYmxlZDogZmFsc2UKIyByZWdpc3RyeV9uYW1lc3BhY2U6IGt1YmUtc3lzdGVtCiMgcmVnaXN0cnlfc3RvcmFnZV9jbGFzczogIiIKIyByZWdpc3RyeV9kaXNrX3NpemU6ICIxMEdpIgoKIyBNZXRyaWNzIFNlcnZlciBkZXBsb3ltZW50Cm1ldHJpY3Nfc2VydmVyX2VuYWJsZWQ6IHRydWUKIyBtZXRyaWNzX3NlcnZlcl9jb250YWluZXJfcG9ydDogMTAyNTAKIyBtZXRyaWNzX3NlcnZlcl9rdWJlbGV0X2luc2VjdXJlX3RsczogdHJ1ZQojIG1ldHJpY3Nfc2VydmVyX21ldHJpY19yZXNvbHV0aW9uOiAxNXMKIyBtZXRyaWNzX3NlcnZlcl9rdWJlbGV0X3ByZWZlcnJlZF9hZGRyZXNzX3R5cGVzOiAiSW50ZXJuYWxJUCxFeHRlcm5hbElQLEhvc3RuYW1lIgojIG1ldHJpY3Nfc2VydmVyX2hvc3RfbmV0d29yazogZmFsc2UKIyBtZXRyaWNzX3NlcnZlcl9yZXBsaWNhczogMQoKIyBSYW5jaGVyIExvY2FsIFBhdGggUHJvdmlzaW9uZXIKbG9jYWxfcGF0aF9wcm92aXNpb25lcl9lbmFibGVkOiBlbmFibGUKbG9jYWxfcGF0aF9wcm92aXNpb25lcl9uYW1lc3BhY2U6ICJsb2NhbC1wYXRoLXN0b3JhZ2UiCmxvY2FsX3BhdGhfcHJvdmlzaW9uZXJfc3RvcmFnZV9jbGFzczogImxvY2FsLXBhdGgiCmxvY2FsX3BhdGhfcHJvdmlzaW9uZXJfcmVjbGFpbV9wb2xpY3k6IERlbGV0ZQpsb2NhbF9wYXRoX3Byb3Zpc2lvbmVyX2NsYWltX3Jvb3Q6IC9vcHQvbG9jYWwtcGF0aC1wcm92aXNpb25lci8KbG9jYWxfcGF0aF9wcm92aXNpb25lcl9kZWJ1ZzogZmFsc2UKIyBsb2NhbF9wYXRoX3Byb3Zpc2lvbmVyX2ltYWdlX3JlcG86ICJ7eyBkb2NrZXJfaW1hZ2VfcmVwbyB9fS9yYW5jaGVyL2xvY2FsLXBhdGgtcHJvdmlzaW9uZXIiCiMgbG9jYWxfcGF0aF9wcm92aXNpb25lcl9oZWxwZXJfaW1hZ2VfcmVwbzogImJ1c3lib3giCiMgbG9jYWxfcGF0aF9wcm92aXNpb25lcl9oZWxwZXJfaW1hZ2VfdGFnOiAibGF0ZXN0IgoKIyBMb2NhbCB2b2x1bWUgcHJvdmlzaW9uZXIgZGVwbG95bWVudApsb2NhbF92b2x1bWVfcHJvdmlzaW9uZXJfZW5hYmxlZDogZmFsc2UKIyBsb2NhbF92b2x1bWVfcHJvdmlzaW9uZXJfbmFtZXNwYWNlOiBrdWJlLXN5c3RlbQojIGxvY2FsX3ZvbHVtZV9wcm92aXNpb25lcl9ub2RlbGFiZWxzOgojICAgLSBrdWJlcm5ldGVzLmlvL2hvc3RuYW1lCiMgICAtIHRvcG9sb2d5Lmt1YmVybmV0ZXMuaW8vcmVnaW9uCiMgICAtIHRvcG9sb2d5Lmt1YmVybmV0ZXMuaW8vem9uZQojIGxvY2FsX3ZvbHVtZV9wcm92aXNpb25lcl9zdG9yYWdlX2NsYXNzZXM6CiMgICBsb2NhbC1zdG9yYWdlOgojICAgICBob3N0X2RpcjogL21udC9kaXNrcwojICAgICBtb3VudF9kaXI6IC9tbnQvZGlza3MKIyAgICAgdm9sdW1lX21vZGU6IEZpbGVzeXN0ZW0KIyAgICAgZnNfdHlwZTogZXh0NAojICAgZmFzdC1kaXNrczoKIyAgICAgaG9zdF9kaXI6IC9tbnQvZmFzdC1kaXNrcwojICAgICBtb3VudF9kaXI6IC9tbnQvZmFzdC1kaXNrcwojICAgICBibG9ja19jbGVhbmVyX2NvbW1hbmQ6CiMgICAgICAgLSAiL3NjcmlwdHMvc2hyZWQuc2giCiMgICAgICAgLSAiMiIKIyAgICAgdm9sdW1lX21vZGU6IEZpbGVzeXN0ZW0KIyAgICAgZnNfdHlwZTogZXh0NAojIGxvY2FsX3ZvbHVtZV9wcm92aXNpb25lcl90b2xlcmF0aW9uczoKIyAgIC0gZWZmZWN0OiBOb1NjaGVkdWxlCiMgICAgIG9wZXJhdG9yOiBFeGlzdHMKCiMgQ1NJIFZvbHVtZSBTbmFwc2hvdCBDb250cm9sbGVyIGRlcGxveW1lbnQsIHNldCB0aGlzIHRvIHRydWUgaWYgeW91ciBDU0kgaXMgYWJsZSB0byBtYW5hZ2Ugc25hcHNob3RzCiMgY3VycmVudGx5LCBzZXR0aW5nIGNpbmRlcl9jc2lfZW5hYmxlZD10cnVlIHdvdWxkIGF1dG9tYXRpY2FsbHkgZW5hYmxlIHRoZSBzbmFwc2hvdCBjb250cm9sbGVyCiMgTG9uZ2hvcm4gaXMgYW4gZXh0ZXJuYWwgQ1NJIHRoYXQgd291bGQgYWxzbyByZXF1aXJlIHNldHRpbmcgdGhpcyB0byB0cnVlIGJ1dCBpdCBpcyBub3QgaW5jbHVkZWQgaW4ga3ViZXNwcmF5CiMgY3NpX3NuYXBzaG90X2NvbnRyb2xsZXJfZW5hYmxlZDogZmFsc2UKIyBjc2kgc25hcHNob3QgbmFtZXNwYWNlCiMgc25hcHNob3RfY29udHJvbGxlcl9uYW1lc3BhY2U6IGt1YmUtc3lzdGVtCgojIEdhdGV3YXkgQVBJIENSRHMKZ2F0ZXdheV9hcGlfZW5hYmxlZDogZmFsc2UKCiMgTmdpbnggaW5ncmVzcyBjb250cm9sbGVyIGRlcGxveW1lbnQKaW5ncmVzc19uZ2lueF9lbmFibGVkOiB0cnVlCmluZ3Jlc3NfbmdpbnhfaG9zdF9uZXR3b3JrOiB0cnVlCiMgaW5ncmVzc19uZ2lueF9zZXJ2aWNlX3R5cGU6IExvYWRCYWxhbmNlcgojIGluZ3Jlc3Nfbmdpbnhfc2VydmljZV9hbm5vdGF0aW9uczoKIyAgIGV4YW1wbGUuaW8vbG9hZGJhbGFuY2VySVBzOiAxLjIuMy40CiMgaW5ncmVzc19uZ2lueF9zZXJ2aWNlX25vZGVwb3J0X2h0dHA6IDMwMDgwCiMgaW5ncmVzc19uZ2lueF9zZXJ2aWNlX25vZGVwb3J0X2h0dHBzOiAzMDA4MQppbmdyZXNzX3B1Ymxpc2hfc3RhdHVzX2FkZHJlc3M6ICIiCiMgaW5ncmVzc19uZ2lueF9ub2Rlc2VsZWN0b3I6CiMgICBrdWJlcm5ldGVzLmlvL29zOiAibGludXgiCiMgaW5ncmVzc19uZ2lueF90b2xlcmF0aW9uczoKIyAgIC0ga2V5OiAibm9kZS1yb2xlLmt1YmVybmV0ZXMuaW8vY29udHJvbC1wbGFuZSIKIyAgICAgb3BlcmF0b3I6ICJFcXVhbCIKIyAgICAgdmFsdWU6ICIiCiMgICAgIGVmZmVjdDogIk5vU2NoZWR1bGUiCiMgaW5ncmVzc19uZ2lueF9uYW1lc3BhY2U6ICJpbmdyZXNzLW5naW54IgojIGluZ3Jlc3NfbmdpbnhfaW5zZWN1cmVfcG9ydDogODAKIyBpbmdyZXNzX25naW54X3NlY3VyZV9wb3J0OiA0NDMKIyBpbmdyZXNzX25naW54X2NvbmZpZ
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.